Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
his instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "68fd54265ea1cf5ec94d3d6652b543c5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - key                           = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 6d968c8f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "9610e404e012585b38939469b04fcf8e" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" -> null
      - key                           = "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 73b674f0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "21aaf27e802db30b71887f484e0782a9" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> null
      - key                           = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6257038561880436173" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f725302109ea1bb03b37a134573c33b625324fdd7e0e4dfa2ff1a0bb2b226d63.zip" -> "builds/efd52edf0b92d5c366de2c78a721d135ad86fcd47221358b60ed3213f5a4d53c.zip"
          ~ "timestamp" = "1758263958461823000" -> "1758271880576734000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object 13e5fc03) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "712718980632995849" -> null
      - triggers = {
          - "filename"  = "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip"
          - "timestamp" = "1758249673262658200"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object 334dbcfa) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5387680724935524444" -> null
      - triggers = {
          - "filename"  = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip"
          - "timestamp" = "1758162474948396000"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object dbe51a8e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1049456738398553898" -> null
      - triggers = {
          - "filename"  = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip"
          - "timestamp" = "1756111466663596000"
        } -> null
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8004429117613452708" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263961119850000" -> "1758271880748963200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:b3ecefdd0e6639559fd3f781d8e5c2230bde197e8a4e20c8b98b67c032cf2d90460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:b3ecefdd0e6639559fd3f781d8e5c2230bde197e8a4e20c8b98b67c032cf2d90" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "819b66818297452510b06f9da6506e85466b9018" -> "8d9bb67bf0af67580cc21339b887fecb0ac3df57"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this (deposed object 3bf87243) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:b3ecefdd0e6639559fd3f781d8e5c2230bde197e8a4e20c8b98b67c032cf2d90460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
      - image_id     = "sha256:b3ecefdd0e6639559fd3f781d8e5c2230bde197e8a4e20c8b98b67c032cf2d90" -> null
      - keep_locally = false -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
      - repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> null
      - triggers     = {
          - "dir_sha" = "1c67e2765ed43960532cd4feff4f37d46b86dd86"
        } -> null

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this (deposed object efb157af) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:b3ecefdd0e6639559fd3f781d8e5c2230bde197e8a4e20c8b98b67c032cf2d90460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
      - image_id     = "sha256:b3ecefdd0e6639559fd3f781d8e5c2230bde197e8a4e20c8b98b67c032cf2d90" -> null
      - keep_locally = false -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
      - repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> null
      - triggers     = {
          - "dir_sha" = "33480e606367a655d62f09b8cd6e11949fbda682"
        } -> null

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "819b66818297452510b06f9da6506e85466b9018" -> "8d9bb67bf0af67580cc21339b887fecb0ac3df57"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this (deposed object 77ca5ebc) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:44df3082eb66a76add67616206c93abe608bd9cf0e9fe92c77c02c245421a8c0" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
      - sha256_digest        = "sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> null
      - triggers             = {
          - "dir_sha" = "33480e606367a655d62f09b8cd6e11949fbda682"
        } -> null
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this (deposed object cb109cd8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:6a6c3b0038f02376243261db277dde60c596855ec1ada652cceacfe01b4ef889" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
      - sha256_digest        = "sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> null
      - triggers             = {
          - "dir_sha" = "1c67e2765ed43960532cd4feff4f37d46b86dd86"
        } -> null
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:809266e7b7fb718166c9d1acfe60d6c5ddbb058b763ab378faaf269c2204c518460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:809266e7b7fb718166c9d1acfe60d6c5ddbb058b763ab378faaf269c2204c518" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "f5025d7876750887fed16d0b2b97ed177c96dc73" -> "8f2dabd180da63df1b73f53bd8975559cf737a81"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this (deposed object 5c2a5ece) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:809266e7b7fb718166c9d1acfe60d6c5ddbb058b763ab378faaf269c2204c518460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - image_id     = "sha256:809266e7b7fb718166c9d1acfe60d6c5ddbb058b763ab378faaf269c2204c518" -> null
      - keep_locally = false -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> null
      - triggers     = {
          - "dir_sha" = "e58e9cea3a61426bad4537498e613baa40ae4b2a"
        } -> null

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this (deposed object 7f04708c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:809266e7b7fb718166c9d1acfe60d6c5ddbb058b763ab378faaf269c2204c518460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - image_id     = "sha256:809266e7b7fb718166c9d1acfe60d6c5ddbb058b763ab378faaf269c2204c518" -> null
      - keep_locally = false -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> null
      - triggers     = {
          - "dir_sha" = "53c87c2adf72737131b4918ff33c93580b62b22e"
        } -> null

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "f5025d7876750887fed16d0b2b97ed177c96dc73" -> "8f2dabd180da63df1b73f53bd8975559cf737a81"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this (deposed object 02d70864) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:5472cf0eab296dc8deab8e4e3e6af0cbf62b5d8ffef5f71915852fec454c4fd1" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - sha256_digest        = "sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> null
      - triggers             = {
          - "dir_sha" = "d89093227325fa7ea1c3d445e2bd7934726d6ca0"
        } -> null
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this (deposed object 2337d1a3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:62dc330679d639b71c5365603f6393048bfeddb37d020ef92db178debdaadfd1" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - sha256_digest        = "sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> null
      - triggers             = {
          - "dir_sha" = "53c87c2adf72737131b4918ff33c93580b62b22e"
        } -> null
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this (deposed object bca52467) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - sha256_digest        = "sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> null
      - triggers             = {
          - "dir_sha" = "e58e9cea3a61426bad4537498e613baa40ae4b2a"
        } -> null
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3547149421084257510" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969160536000" -> "1758271893317603200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (deposed object 072264f3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4476735526647824885" -> null
      - triggers = {
          - "filename"  = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
          - "timestamp" = "1758249688469647000"
        } -> null
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] (deposed object daa1708e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8134589134119453362" -> null
      - triggers = {
          - "filename"  = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
          - "timestamp" = "1758162473730918000"
        } -> null
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "328432450189002302" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263968866901000" -> "1758271892853440000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object 04170820) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7909297504390108772" -> null
      - triggers = {
          - "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          - "timestamp" = "1756111471769906000"
        } -> null
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object 89b880bc) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7560956386625967781" -> null
      - triggers = {
          - "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          - "timestamp" = "1758162472265496000"
        } -> null
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object fa924293) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4687967804849050175" -> null
      - triggers = {
          - "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          - "timestamp" = "1758249689051910000"
        } -> null
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3744718928838305844" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969619593000" -> "1758271892970360000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5882405521071338075" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263968630847000" -> "1758271893335870000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] (deposed object 011c294d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1044801428294880422" -> null
      - triggers = {
          - "filename"  = "builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip"
          - "timestamp" = "1758162471743676000"
        } -> null
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] (deposed object 57ee1d72) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1734754023498512585" -> null
      - triggers = {
          - "filename"  = "builds/52961fb8310c601e9a92b8931c8a754ccf650ffe0a78f8c268a29ccf2104d630.zip"
          - "timestamp" = "1758249688551296000"
        } -> null
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6385519726486042914" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969285700000" -> "1758271892160059000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] (deposed object 35f42921) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7586718031411934196" -> null
      - triggers = {
          - "filename"  = "builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip"
          - "timestamp" = "1758249688531209000"
        } -> null
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] (deposed object 4e828074) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5761105775097779277" -> null
      - triggers = {
          - "filename"  = "builds/e32e7bc23825285db2c8e77e4c438ef201a02c80f66935d59fd271ec6be661b9.zip"
          - "timestamp" = "1758162472936353000"
        } -> null
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8999311239159625823" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969364636800" -> "1758271893144892000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (deposed object 645331eb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1069987485273622304" -> null
      - triggers = {
          - "filename"  = "builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip"
          - "timestamp" = "1758249688781478000"
        } -> null
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] (deposed object 8bd04a65) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1905083761411757977" -> null
      - triggers = {
          - "filename"  = "builds/4dbaff60e6cff0035b0719661c0d997df409a3c6c595846c8d86d93a15e50817.zip"
          - "timestamp" = "1758162473128501000"
        } -> null
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5832967886797664907" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263968826659000" -> "1758271892719839000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] (deposed object 0e552e61) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1403011275793836632" -> null
      - triggers = {
          - "filename"  = "builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip"
          - "timestamp" = "1758249688407360000"
        } -> null
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] (deposed object b3159e2a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1031823679640956384" -> null
      - triggers = {
          - "filename"  = "builds/03e47b8673762c54e2f7762675cd423c0bebdb5bd1cb7f4a0573c8ed171d086c.zip"
          - "timestamp" = "1758162473449449000"
        } -> null
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3483962929714971411" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969761439000" -> "1758271893152388000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (deposed object e61c5a47) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "831292757022756766" -> null
      - triggers = {
          - "filename"  = "builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip"
          - "timestamp" = "1758162473572849000"
        } -> null
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] (deposed object f99f0b7e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6603464723893759194" -> null
      - triggers = {
          - "filename"  = "builds/efbe332550e396aeb9e3726b8a2c758071cd4cae4df8bd16f8c036da6bd9512d.zip"
          - "timestamp" = "1758249688300942800"
        } -> null
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1e3b27a5168358bb70f2ad3557c51640b1974c6332d150a26460164983fbaa51.zip" -> "builds/f7bde458d929736fc67b2c8a00111db88f3d38a3ca4f3dd64386778f1fbc0cd4.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-19T06:42:48.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f7bde458d929736fc67b2c8a00111db88f3d38a3ca4f3dd64386778f1fbc0cd4.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f7bde458d929736fc67b2c8a00111db88f3d38a3ca4f3dd64386778f1fbc0cd4.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "343654764487582304" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1e3b27a5168358bb70f2ad3557c51640b1974c6332d150a26460164983fbaa51.zip" -> "builds/f7bde458d929736fc67b2c8a00111db88f3d38a3ca4f3dd64386778f1fbc0cd4.zip"
          ~ "timestamp" = "1758263970051308000" -> "1758271893370558000"
        }
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (deposed object 6a28a8e2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5682878083519691518" -> null
      - triggers = {
          - "filename"  = "builds/043d433a265fb61267a1d18feb51e7cea2e190ed1002f8947df9489063e4bd9d.zip"
          - "timestamp" = "1758249688921578800"
        } -> null
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] (deposed object 751a65d7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7151886515801202329" -> null
      - triggers = {
          - "filename"  = "builds/e7b5e04fc1f308dfcadd91986df8765b81447b92082c3ed0ca153bca322b0a79.zip"
          - "timestamp" = "1758162473653501000"
        } -> null
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6709271951606377140" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969771346000" -> "1758271892051911200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object 77c0b758) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6326550553961423041" -> null
      - triggers = {
          - "filename"  = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
          - "timestamp" = "1758162474435986000"
        } -> null
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object cedd1070) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4509652308501032224" -> null
      - triggers = {
          - "filename"  = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
          - "timestamp" = "1756111472429896200"
        } -> null
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object d8150f00) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4498729018185921697" -> null
      - triggers = {
          - "filename"  = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
          - "timestamp" = "1758249688392704000"
        } -> null
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7750225991465467111" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263968506733000" -> "1758271891921053800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] (deposed object 30d9d711) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7903114538572477559" -> null
      - triggers = {
          - "filename"  = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
          - "timestamp" = "1758249689040241000"
        } -> null
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] (deposed object 9035b989) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "136244236526779431" -> null
      - triggers = {
          - "filename"  = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
          - "timestamp" = "1756111472029106000"
        } -> null
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] (deposed object d711e77d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5939637829075640427" -> null
      - triggers = {
          - "filename"  = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
          - "timestamp" = "1758162472919303000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4539755960611862005" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263970062130000" -> "1758271892125703000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (deposed object 26c6e479) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6602482484474837763" -> null
      - triggers = {
          - "filename"  = "builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip"
          - "timestamp" = "1758249688659776000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] (deposed object e3d29b92) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4133450959732263947" -> null
      - triggers = {
          - "filename"  = "builds/0629f553e0d9d4c0c3bcc2f6571ed245b9f759b5d35f2a88fcd9efede5ec63af.zip"
          - "timestamp" = "1758162472133227200"
        } -> null
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:c1d4decf4d6d10e660b553520f4c064d23c4980b6b5b3be15711ce3b9448ede0" -> (known after apply)
      ~ last_modified                  = "2025-09-19T06:42:57.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4784761696417945856" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969069460000" -> "1758271893451602000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (deposed object 09272e35) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5968924290460716664" -> null
      - triggers = {
          - "filename"  = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
          - "timestamp" = "1758162473859124000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] (deposed object 38d12cfa) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5697528667347327376" -> null
      - triggers = {
          - "filename"  = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
          - "timestamp" = "1758249689032835000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1679949682037240789" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263969068416200" -> "1758271891982114000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (deposed object 22078f7c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "655828281715019771" -> null
      - triggers = {
          - "filename"  = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
          - "timestamp" = "1758162472948857000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] (deposed object fc68ee46) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5258646634713273200" -> null
      - triggers = {
          - "filename"  = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
          - "timestamp" = "1758249687960180000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f2f1f9b9b87333f037b2b942a1e60c81ba91bbdf6fe928117728734cd0f0a472.zip" -> "builds/78e149a0638f52eac17857b9cb7649884b3d49691eeff8e418ec9bd37f72a2ab.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-19T06:42:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/78e149a0638f52eac17857b9cb7649884b3d49691eeff8e418ec9bd37f72a2ab.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/78e149a0638f52eac17857b9cb7649884b3d49691eeff8e418ec9bd37f72a2ab.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "979384357006532420" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f2f1f9b9b87333f037b2b942a1e60c81ba91bbdf6fe928117728734cd0f0a472.zip" -> "builds/78e149a0638f52eac17857b9cb7649884b3d49691eeff8e418ec9bd37f72a2ab.zip"
          ~ "timestamp" = "1758263970147522000" -> "1758271891670232000"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (deposed object 058e9062) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7116023371888837059" -> null
      - triggers = {
          - "filename"  = "builds/7638974d6180381f44e730fe5b2ff34364a2b0655de7ef2f09b72141e8120ddf.zip"
          - "timestamp" = "1758249688046722800"
        } -> null
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] (deposed object ff852274) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1785702948850392397" -> null
      - triggers = {
          - "filename"  = "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.zip"
          - "timestamp" = "1758162473022477000"
        } -> null
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:3cb25f4a153e7a386de129323be8d5e286c6f0c8b83b188bc4f339297a5002ea" -> (known after apply)
      ~ last_modified                  = "2025-09-19T06:42:39.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:19",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6566136577744791516" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758263968618064000" -> "1758271893046864000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (deposed object 3cfc4695) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3388479997595603307" -> null
      - triggers = {
          - "filename"  = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip"
          - "timestamp" = "175824968
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.